package message

//nolint:lll
const rulesMessage = `
<b>Правила групи</b>:
Code of Conduct: https://go.dev/conduct

Продуктивне спілкування вимагає зусиль, подумайте, як ваші слова будуть сприйняті. Зокрема:
	- Поважайте різницю у поглядах.
	- Користуйтеся принципами взаємоповаги.
	- Уникайте неконструктивної критики, обговорення потенційно образливих або чутливих питань. 

За порушення Code of Conduct адміни групу можуть дати попередження, відправити в мовчанку на декілька днів або заблокувати назавжди, <i>в залежності від ситуації</i>. 

Youtube: https://www.youtube.com/@GolangUA
Github: https://github.com/golangua

Канали:
	- main() - основна гілку спілкування, все що стосується мови Go і новин спільнути. Просимо писати одним повідомленням, краще відредагувати повідомлення аніж написати 2-3 нових. Уникати повідомлень в 1-3 слова.
	- flood - флуд :) 
	- tech (non-Go) - обговорення всіх інших мов, технологій і інструментів
	- interview preparation - добірка матеріалів і питань для підготовки до інтервʼю
	- vacancy - канал для вакансій і пошуку роботи. 
	- kyiv, lviv - місцеві канали
	- algorithms - обговорення алгоритмів і вирішення задач по типу leetcode
	- переклади - канал для перекладів матеріалів на українську мову
`
