package message

import "fmt"

//nolint:lll
const rulesMessage = `
<b>Правила групи</b>:
Code of Conduct: https://go.dev/conduct

- Повага
	Ця спільнота об'єднує людей з різними досвідом та поглядами. Отже, рано чи пізно ви зіткнетесь з іншими думками, з котримим можете бути не згодні.
	Пам'ятайте, що повага до інших не завжди означає погодження з ними. Однак, це означає, що ви визнаєте їх як особистість, 
	не вдаєтесь до агресії, образ, знецінення або інших форм неконструктивного спілкування.

- Комунікація
	Група має декілька каналів для спілкування, кожен з яких призначений для певних цілей.
	Будь ласка, дотримуйтесь тематики каналу, щоб не заважати іншим учасникам. В випадку, якщо ви спостерігаєте за відхиленням 
	від теми, порадьте учасникам перейти до відповідного каналу чи використати особисті повідомлення. При потребі - зверніть увагу адміністраторів.
	
	Канали:
	- main() - основна гілка спілкування, все що стосується мови Go і новин спільноти.
		Просимо писати одним повідомленням, краще відредагувати повідомлення аніж написати 2-3 нових. 
		Уникати повідомлень в 1-3 слова.
	- learning - канал для допомоги при вивченні мови Go (базові питання, пояснення, поради)
	- flood - флуд :) 
	- tech (non-Go) - обговорення всіх інших мов, технологій та інструментів
	- interview preparation - добірка матеріалів і питань для підготовки до інтервʼю
	- vacancy - канал для вакансій і пошуку роботи
	- kyiv, lviv - місцеві канали
	- algorithms - обговорення алгоритмів і вирішення задач по типу leetcode
	- переклади - канал для перекладів матеріалів

- Матеріали
	Ми не підтримуємо піратство та порушення авторських прав. При бажанні порадити той чи інший матеріал, будь ласка, 
	діліться посиланнями на офіційні ресурси.

- Код
	Приклади коду, якими ви ділитеся, повинні бути читабельними та зрозумілими. Якщо шматок коду відносно малий (до 20 рядків) - 
	можна використовувати форматування коду в повідомленні. Для великих шматків коду - посилання на приклад в https://go.dev/play.
	Перед публікацією коду, переконайтеся, що він <b>не містить конфіденційної інформації</b>.

- Конфіденційність
	Будь ласка, не діліться конфіденційною інформацією, яка може завдати шкоди вам або іншим учасникам спільноти.
	При бажанні описати поточну/минулу робочу ситуацію, будьте обережні та зверніть увагу на домовленості про нерозголошення.

- Заборонено
	- Підтримка, популяризація та розповсюдження пропаганди рф.
	- Будь-які форми дискримінації (не чинне до осіб, що підтримують рф).
	- Розсіювати агресію, образи, знецінення і т.д.
	- Публікація матеріалів, що порушують авторські права (піратство).
	- Популяризіція російських ресурсів (такі посилання можуть бути видалені адміністраторами без попередження)

За порушення Code of Conduct адміністратори групи можуть дати попередження, відправити в read-only на декілька днів або заблокувати назавжди, <i>в залежності від ситуації</i>.
`

const usefulInfoMessage = `
<b>Корисні матеріали:</b>

<i>Англійською 🌍:</i>
	- <a href="https://go.dev/doc/">Go documentation</a>
	- <a href="https://gobyexample.com/">Go by example</a>
	- <a href="https://go.dev/doc/effective_go">Effective Go</a>
	- <a href="https://go.dev/blog/">The Go blog</a>
	- <a href="https://golangweekly.com/issues/latest">Golang weekly</a>
	- <a href="https://yourbasic.org/golang/">Go go-to guide</a>
	- <a href="https://golang50shad.es/">50 Go common gotchas</a>
	- <a href="https://100go.co/">100 Go mistakes</a>
	- <a href="https://roadmap.sh/golang">Go roadmap</a>

<i>Українською 🇺🇦:</i>
	- <a href="https://go-tour-ua-translation.lm.r.appspot.com/welcome/1">Go tour (переклад)</a>
	- <a href="https://butuzov.github.io/gobyexample/">Go by example (переклад)</a>
	- <a href="https://www.youtube.com/playlist?list=PL7PnqERoHp6jLHoYrenz9cwJojFlNyENr">Intellias Go coures</a>
	- <a href="https://www.youtube.com/@gou.ukraine">Gou Ukraine</a>
	- <a href="https://www.youtube.com/@bluegophercult">Культ синього ховраха</a>
	- <a href="https://www.youtube.com/@GolangUA">GolangUA Youtube</a>
	- <a href="https://github.com/golangua">GolangUA GitHub</a>

Більше інформації шукай <a href="https://bit.ly/3XCIKT4">тут</a>.
`

//nolint:lll
const helpMessageFormat = `
Привіт, %s!
Я бот створений спеціально для спільноти <a href="https://t.me/golang_ua_official">GolangUA</a> з метою полегшення адміністрування.

Наявні команди:
	- /help: інформація про бота
	- /rules: правила спільноти
	- /useful: корисна інформація (курси, документацію, платформи для навчання) по Go

У разі різних питань, неточностей або несправності бота сконтактуйте адміністраторa: @%s.
`

func getHelpMessage(username, admin string) string {
	return fmt.Sprintf(helpMessageFormat, username, admin)
}
