package messages

//nolint:lll
const Rules = `
<b>Правила групи</b>:
Code of Conduct: https://go.dev/conduct

<b>Повага</b>
Ця спільнота об'єднує людей з різними досвідом та поглядами. Отже, рано чи пізно ви зіткнетесь з іншими думками, з котримим можете бути не згодні. Пам'ятайте, що повага до інших не завжди означає погодження з ними. Однак, це означає, що ви визнаєте їх як особистість, не вдаєтесь до агресії, образ, знецінення або інших форм неконструктивного спілкування.

<b>Комунікація</b>
Група має декілька каналів для спілкування, кожен з яких призначений для певних цілей. Будь ласка, дотримуйтесь тематики каналу, щоб не заважати іншим учасникам. В випадку, якщо ви спостерігаєте за відхиленням від теми, порадьте учасникам перейти до відповідного каналу чи використати особисті повідомлення. При потребі - зверніть увагу адміністраторів.
	
Канали:
<a href="https://t.me/golang_ua_official/13867"><u>main()</u></a> - основна гілка спілкування, все що стосується мови Go і новин спільноти. Просимо писати одним повідомленням, краще відредагувати повідомлення аніж написати 2-3 нових. Уникати повідомлень в 1-3 слова.
<a href="https://t.me/golang_ua_official/44029"><u>learning</u></a> - канал для допомоги при вивченні мови Go (базові питання, пояснення, поради)
<a href="https://t.me/golang_ua_official/14800"><u>flood</u></a> - флуд :)
<a href="https://t.me/golang_ua_official/33333"><u>tech (non-Go)</u></a> - обговорення всіх інших мов, технологій та інструментів
<a href="https://t.me/golang_ua_official/37569"><u>interview preparation</u></a> - добірка матеріалів і питань для підготовки до інтервʼю
<a href="https://t.me/golang_ua_official/14805"><u>vacancy</u></a> - канал для вакансій і пошуку роботи
<a href="https://t.me/golang_ua_official/19211"><u>kyiv</u></a>, <a href="https://t.me/golang_ua_official/19210"><u>lviv</u></a> - місцеві канали
<a href="https://t.me/golang_ua_official/15567"><u>algorithms</u></a> - обговорення алгоритмів і вирішення задач по типу leetcode
<a href="https://t.me/golang_ua_official/14111"><u>переклади</u></a> - канал для перекладів матеріалів

<b>Матеріали</b>
Ми не підтримуємо піратство та порушення авторських прав. При бажанні порадити той чи інший матеріал, будь ласка, діліться посиланнями на офіційні ресурси.

<b>Код</b>
Приклади коду, якими ви ділитеся, повинні бути читабельними та зрозумілими. Якщо шматок коду відносно малий (до 20 рядків) - можна використовувати форматування коду в повідомленні. Для великих шматків коду - посилання на приклад в https://go.dev/play. Перед публікацією коду, переконайтеся, що він <b>не містить конфіденційної інформації</b>.

<b>Конфіденційність</b>
Будь ласка, не діліться конфіденційною інформацією, яка може завдати шкоди вам або іншим учасникам спільноти. При бажанні описати поточну/минулу робочу ситуацію, будьте обережні та зверніть увагу на домовленості про нерозголошення.

<b>Заборонено</b>
- Підтримка, популяризація та розповсюдження пропаганди рф.
- Будь-які форми дискримінації (не чинне до осіб, що підтримують рф).
- Розсіювати агресію, образи, знецінення і т.д.
- Публікація матеріалів, що порушують авторські права (піратство).
- Популяризіція російських ресурсів (такі посилання можуть бути видалені адміністраторами без попередження)

За порушення Code of Conduct адміністратори групи можуть дати попередження, відправити в read-only на декілька днів або заблокувати назавжди, <i>в залежності від ситуації</i>.
`
