package messages

const JoinHeader = `
Вітаємо! Ви подали запит на вступ до групи <b>GolangUA</b>.
`

//nolint:lll
const JoinFooter = `
Перед тим як прийняти рішення, будь ласка, привітайтесь з ботом, написавши довільне повідомлення. Після цього ви зможете натиснути на потрібну кнопну та отримати результат вашого запиту.

Приймаючи запрошення в цю групу ви автоматично:
	1. Засуджуєте війну рф проти України.
	2. Не визнаєте тимчасовано окупованії українські території субʼєктом рф.
	3. Приймаєте правила спільноти.
`
